Revit 2024 API
EnergyAnalysisWindowType Class
 The EnergyAnalysisWindowType class contains window type data for gbXml export.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public class EnergyAnalysisWindowType : Element
Visual Basic
Public Class EnergyAnalysisWindowType _
	Inherits Element
Visual C++
public ref class EnergyAnalysisWindowType : public Element
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Analysis.EnergyAnalysisWindowType
See Also
EnergyAnalysisWindowType Members
Autodesk.Revit.DB.Analysis Namespace